tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
const char* observationStatusLabel(Irrigation::PlanObservationStatus status) {
    switch (status) {
        case Irrigation::PlanObservationStatus::STARTED: return "计划已启动";
        case Irrigation::PlanObservationStatus::SKIPPED_CALENDAR: return "当天已设置跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_DISABLED: return "计划或水路已停用";
        case Irrigation::PlanObservationStatus::SKIPPED_BUSY: return "水路正在执行其他任务";
        case Irrigation::PlanObservationStatus::SKIPPED_ERROR: return "水路处于异常状态";
        case Irrigation::PlanObservationStatus::SKIPPED_LEAK: return "因漏水告警跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_RESET: return "恢复出厂中跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_CYCLE: return "非本轮执行日";
        case Irrigation::PlanObservationStatus::SKIPPED_CONFIG_INVALID: return "配置无效，未执行";
        case Irrigation::PlanObservationStatus::REJECTED: return "启动被拒绝";
        case Irrigation::PlanObservationStatus::MISSED: return "系统发现计划已错过";
        case Irrigation::PlanObservationStatus::NOT_EVALUATED:
        default: return "未评估";
    }
}

void sendMetricCard(const char* label, const char* value, const char* help, const char* tone = nullptr, const char* id = nullptr) {
    Esp32BaseWeb::sendChunk("<div class='metric");
    if (tone && tone[0]) {
        Esp32BaseWeb::sendChunk(" ");
        Esp32BaseWeb::writeHtmlEscaped(tone);
    }
    Esp32BaseWeb::sendChunk("'");
    if (id && id[0]) {
        Esp32BaseWeb::sendChunk(" id='");
        Esp32BaseWeb::writeHtmlEscaped(id);
        Esp32BaseWeb::sendChunk("'");
    }
    if (tone && strcmp(tone, "danger") == 0) {
        Esp32BaseWeb::sendChunk(" style='border-color:#efc0ba;background:var(--eb-danger-soft);color:var(--eb-danger)'");
    }
    Esp32BaseWeb::sendChunk("><b>");
    Esp32BaseWeb::writeHtmlEscaped(value ? value : "");
    Esp32BaseWeb::sendChunk("</b><span>");
    Esp32BaseWeb::writeHtmlEscaped(label ? label : "");
    if (help && help[0]) {
        Esp32BaseWeb::sendChunk(" · ");
        Esp32BaseWeb::writeHtmlEscaped(help);
    }
    Esp32BaseWeb::sendChunk("</span></div>");
}

const char* appEventLevelLabel(uint8_t level) {
    switch (level) {
        case Esp32BaseAppEventLog::LEVEL_INFO: return "信息";
        case Esp32BaseAppEventLog::LEVEL_WARN: return "注意";
        case Esp32BaseAppEventLog::LEVEL_ERROR: return "故障";
        default: return "未知";
    }
}

const char* appEventSourceLabel(const char* source) {
    if (strcmp(source, "web") == 0) return "网页";
    if (strcmp(source, "api") == 0) return "API";
    if (strcmp(source, "button") == 0) return "本地按键";
    if (strcmp(source, "schedule") == 0) return "计划";
    if (strcmp(source, "monitor") == 0) return "监控";
    if (strcmp(source, "runtime") == 0) return "运行保护";
    return source;
}

const char* appEventTypeLabel(const char* type) {
    if (strcmp(type, "schedule_skipped") == 0) return "计划跳过";
    if (strcmp(type, "schedule_unskipped") == 0) return "取消跳过";
    if (strcmp(type, "flow_fault") == 0) return "流量异常";
    if (strcmp(type, "leak_detected") == 0) return "漏水检测";
    if (strcmp(type, "zone_locked") == 0) return "水路锁定";
    if (strcmp(type, "alert_cleared") == 0) return "告警清除";
    if (strcmp(type, "safety_stop") == 0) return "安全停止";
    if (strcmp(type, "factory_reset") == 0) return "恢复出厂";
    return type;
}

uint8_t zoneIdFromEventObject(const char* object) {
    if (!object || strncmp(object, "zone:", 5) != 0) {
        return 0;
    }
    const unsigned long raw = strtoul(object + 5, nullptr, 10);
    return raw <= 255UL ? static_cast<uint8_t>(raw) : 0;
}

uint8_t eventZoneId(const Esp32BaseAppEventRecord& event) {
    const uint8_t direct = zoneIdFromEventObject(event.object);
    if (Irrigation::validZoneId(direct)) {
        return direct;
    }
    if (strcmp(event.type, "schedule_skipped") == 0 &&
        strcmp(event.source, "schedule") == 0 &&
        (event.valueMask & Esp32BaseAppEventLog::VALUE1) &&
        event.value1 >= 1 &&
        event.value1 <= Irrigation::MaxZones) {
        return static_cast<uint8_t>(event.value1);
    }
    return 0;
}

void writeEventZoneName(uint8_t zoneId) {
    if (Irrigation::validZoneId(zoneId)) {
        Esp32BaseWeb::writeHtmlEscaped(ZoneManager::config(zoneId).name);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
}

void writeEventDetailValue(const char* label, int32_t value, const char* unit = nullptr) {
    Esp32BaseWeb::sendChunk("；");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk(" ");
    char text[16];
    snprintf(text, sizeof(text), "%ld", static_cast<long>(value));
    Esp32BaseWeb::writeHtmlEscaped(text);
    if (unit && unit[0]) {
        Esp32BaseWeb::sendChunk(" ");
        Esp32BaseWeb::writeHtmlEscaped(unit);
    }
}

void writeEventDetail(const Esp32BaseAppEventRecord& event) {
    if (strcmp(event.type, "schedule_skipped") == 0) {
        if (strcmp(event.source, "schedule") == 0 && event.code <= static_cast<uint16_t>(Irrigation::PlanObservationStatus::MISSED)) {
            Esp32BaseWeb::writeHtmlEscaped(observationStatusLabel(static_cast<Irrigation::PlanObservationStatus>(event.code)));
            if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
                Esp32BaseWeb::sendChunk("；水路 ");
                writeEventZoneName(static_cast<uint8_t>(event.value1));
            }
            if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
                writeEventDetailValue("计划时长", event.value2, "秒");
            }
        } else {
            Esp32BaseWeb::sendChunk("已设置单次跳过");
            if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
                writeEventDetailValue("日期", event.value1, nullptr);
            }
        }
        return;
    }
    if (strcmp(event.type, "schedule_unskipped") == 0) {
        Esp32BaseWeb::sendChunk("已取消单次跳过");
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            writeEventDetailValue("日期", event.value1, nullptr);
        }
        return;
    }
    if (strcmp(event.type, "flow_fault") == 0 || strcmp(event.type, "safety_stop") == 0) {
        Esp32BaseWeb::writeHtmlEscaped(taskResultLabel(static_cast<Irrigation::TaskResult>(event.code)));
        if (strcmp(event.type, "flow_fault") == 0) {
            if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
                writeEventDetailValue("目标", event.value1, "秒");
            }
            if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
                writeEventDetailValue("实际脉冲", event.value2, "个");
            }
            if (event.valueMask & Esp32BaseAppEventLog::VALUE3) {
                Esp32BaseWeb::sendChunk(event.value3 ? "；已锁定水路" : "；仅记录，未锁定");
            }
        }
        return;
    }
    if (strcmp(event.type, "leak_detected") == 0) {
        Esp32BaseWeb::sendChunk("待机状态检测到异常流量");
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            writeEventDetailValue("实际脉冲", event.value1, "个");
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
            writeEventDetailValue("阈值", event.value2, "个");
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE3) {
            writeEventDetailValue("窗口", event.value3, "秒");
        }
        return;
    }
    if (strcmp(event.type, "zone_locked") == 0) {
        Esp32BaseWeb::sendChunk("水路进入异常锁定，需要人工清除");
        if (event.code <= static_cast<uint16_t>(Irrigation::ZoneErrorCode::CONFIG_INVALID)) {
            Esp32BaseWeb::sendChunk("；原因 ");
            Esp32BaseWeb::writeHtmlEscaped(zoneErrorLabel(static_cast<Irrigation::ZoneErrorCode>(event.code)));
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            Esp32BaseWeb::sendChunk("；任务结果 ");
            Esp32BaseWeb::writeHtmlEscaped(taskResultLabel(static_cast<Irrigation::TaskResult>(event.value1)));
        }
        return;
    }
    if (strcmp(event.type, "alert_cleared") == 0) {
        Esp32BaseWeb::sendChunk(strcmp(event.reason, "all_zones") == 0 ? "全部告警已清除" : "水路告警已清除");
        return;
    }
    if (strcmp(event.type, "factory_reset") == 0) {
        if (strcmp(event.reason, "requested") == 0) {
            Esp32BaseWeb::sendChunk("已请求恢复出厂");
        } else if (strcmp(event.reason, "executed") == 0) {
            Esp32BaseWeb::sendChunk("恢复出厂已执行");
        } else {
            Esp32BaseWeb::sendChunk("恢复出厂执行失败");
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            Esp32BaseWeb::sendChunk(event.value1 ? "；包含记录清空" : "；保留业务记录");
        }
        return;
    }
    Esp32BaseWeb::writeHtmlEscaped(event.text);
}

void writeManualStartDialog() {
    const Irrigation::SystemConfig& system = SystemConfigStore::current();
    const uint32_t maxMin = system.maxWateringDurationSec / 60UL;
    const uint32_t defaultMin = durationMinutesForUi(system.manualDefaultDurationSec);

    Esp32BaseWeb::sendChunk("<style>"
                            ".irrmanual{max-width:520px}.irrmanual h2{margin-bottom:10px}.irrmanual-summary{display:grid;grid-template-columns:88px minmax(0,1fr);gap:6px 12px;border:1px solid var(--eb-line-soft);background:var(--eb-soft);border-radius:8px;padding:9px 10px;margin:0 0 12px}.irrmanual-summary b{color:var(--eb-muted);font-weight:650}.irrmanual-summary span{min-width:0}.irrmanual .durationrow{display:grid;grid-template-columns:minmax(0,1fr) auto;gap:10px;align-items:end;margin-bottom:10px}.irrmanual .durationrow input{width:9ch;max-width:9ch;margin:0}.irrmanual-presets{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:6px;margin-top:6px}.irrmanual-presets .btnlink{width:100%;min-height:32px}.irrmanual-note{font-size:12px;color:var(--eb-muted);line-height:1.45;margin:8px 0 0}@media(max-width:560px){.irrmanual .durationrow{grid-template-columns:1fr}.irrmanual-presets{grid-template-columns:repeat(2,minmax(0,1fr))}}"
                            "</style><dialog id='irrManualDialog' class='panel eb-modal irrmanual'><form id='irrManualForm' class='editform' method='post' action='/api/v1/zone/start' data-default-min='");
    writeUInt(defaultMin);
    Esp32BaseWeb::sendChunk("' onsubmit=\"return irrManualSubmit(this)&&irrManualSend(this,once(this))\"><h2>启动手动浇水</h2>");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input type='hidden' name='zoneId' value=''><div class='irrmanual-summary'><b>水路</b><span id='irrManualZoneName'></span><b>安全确认</b><span>远程启动前请确认现场安全，阀门和管路可以正常出水。</span></div><div class='durationrow'><p class='field'><label>浇水分钟数</label><input id='irrManualDuration' name='durationMin' type='number' min='1' max='");
    writeUInt(maxMin);
    Esp32BaseWeb::sendChunk("' value='");
    writeUInt(defaultMin);
    Esp32BaseWeb::sendChunk("'><small>默认 ");
    writeUInt(defaultMin);
    Esp32BaseWeb::sendChunk(" 分钟，最大 ");
    writeUInt(maxMin);
    Esp32BaseWeb::sendChunk(" 分钟。</small></p><div><label>快捷时长</label><div class='irrmanual-presets'>");
    for (uint8_t i = 0; i < 6; ++i) {
        const uint32_t presetMin = durationMinutesForUi(system.durationPresets[i]);
        Esp32BaseWeb::sendChunk("<button class='btnlink compact' type='button' data-min='");
        writeUInt(presetMin);
        Esp32BaseWeb::sendChunk("' onclick='irrManualPreset(this)'>");
        writeUInt(presetMin);
        Esp32BaseWeb::sendChunk(" 分钟</button>");
    }
    Esp32BaseWeb::sendChunk("</div><p class='irrmanual-note'>点选快捷时长会自动填入，确认启动前仍可手动修改。</p></div></div><div class='actions'><input type='submit' value='确认启动'><input class='btnlink secondary' type='button' value='取消' onclick='irrManualCancel()'></div></form></dialog>"
                            "<script>"
                            "function irrManualOpen(b){var d=document.getElementById('irrManualDialog'),f=document.getElementById('irrManualForm');f.elements['zoneId'].value=b.dataset.zoneId;f.elements['durationMin'].value=f.dataset.defaultMin;document.getElementById('irrManualZoneName').textContent=b.dataset.zoneName;if(d.showModal)d.showModal();else d.setAttribute('open','open');}"
                            "function irrManualPreset(b){document.getElementById('irrManualDuration').value=b.dataset.min;}"
                            "function irrManualCancel(){var d=document.getElementById('irrManualDialog');if(d.close)d.close();else d.removeAttribute('open');}"
                            "function irrManualSubmit(f){var m=parseInt(f.elements['durationMin'].value||'0',10),max=parseInt(f.elements['durationMin'].max||'0',10);if(!m||m<1||m>max){alert('请输入 1 到 '+max+' 分钟');return false;}return true;}"
                            "function irrManualReset(f){delete f.dataset.busy;var b=f.querySelector('[type=submit]');if(b)b.disabled=false;}"
                            "function irrManualSend(f,ready){if(!ready)return false;if(!window.fetch||!window.URLSearchParams||!window.FormData)return true;fetch(f.action,{method:'POST',headers:{'X-Esp32Base-Ajax':'1',Accept:'application/json','Content-Type':'application/x-www-form-urlencoded'},body:new URLSearchParams(new FormData(f)).toString(),credentials:'same-origin'}).then(function(r){return r.json().catch(function(){return {ok:false,error:'bad_response'};});}).then(function(j){if(!j||!j.ok){alert('启动失败：'+((j&&j.error)||'请求失败'));irrManualReset(f);return;}irrManualCancel();irrManualReset(f);if(window.irrOverviewPollNow)irrOverviewPollNow();}).catch(function(){alert('启动失败：网络请求失败');irrManualReset(f);});return false;}"
                            "</script>");
}

void readPaging(uint16_t total, uint16_t defaultPerPage, uint32_t* page, uint32_t* perPage, uint16_t* offset) {
    uint32_t rawPage = 1;
    uint32_t rawPer = defaultPerPage;
    (void)readU32("page", &rawPage);
    (void)readU32("per", &rawPer);
    if (rawPer != 10 && rawPer != 20 && rawPer != 50) {
        rawPer = defaultPerPage;
    }
    const uint32_t totalPages = total == 0 ? 1 : ((static_cast<uint32_t>(total) + rawPer - 1UL) / rawPer);
    if (rawPage < 1) {
        rawPage = 1;
    } else if (rawPage > totalPages) {
        rawPage = totalPages;
    }
    *page = rawPage;
    *perPage = rawPer;
    *offset = static_cast<uint16_t>((rawPage - 1UL) * rawPer);
}

void handleOverviewPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    pageHeader("灌溉总览");
    Esp32BaseWeb::sendPageTitle("灌溉总览", "查看今天是否还有计划、当前哪些水路在浇水；需要临时补水时，可在水路状态中启动。");
    if (Esp32BaseWeb::hasParam("alert_cleared")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "异常已清除", "系统已记录本次清除操作。");
    }

    uint8_t enabledCount = 0;
    uint8_t runningCount = 0;
    uint8_t errorCount = 0;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        if (!status.enabled) {
            continue;
        }
        ++enabledCount;
        if (status.busy) {
            ++runningCount;
        }
        if (status.errorActive) {
            ++errorCount;
        }
    }
    const uint8_t todayPlanCount = countPlansForDate(currentYmd());

