tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
    char runningText[16];
    char errorText[16];
    char safetyText[24];
    char todayPlanText[16];
    snprintf(runningText, sizeof(runningText), "%u / %u", static_cast<unsigned>(runningCount), static_cast<unsigned>(enabledCount));
    snprintf(errorText, sizeof(errorText), "%u", static_cast<unsigned>(errorCount));
    snprintf(todayPlanText, sizeof(todayPlanText), "%u", static_cast<unsigned>(todayPlanCount));
    if (ZoneManager::leakAlertActive()) {
        strlcpy(safetyText, "漏水告警", sizeof(safetyText));
    } else if (errorCount > 0) {
        snprintf(safetyText, sizeof(safetyText), "%u 路异常", static_cast<unsigned>(errorCount));
    } else {
        strlcpy(safetyText, "正常", sizeof(safetyText));
    }

    Esp32BaseWeb::beginPanel("关键指标");
    Esp32BaseWeb::beginMetricGrid();
    sendMetricCard("系统状态", safetyText, ZoneManager::leakAlertActive() ? "请先到现场确认是否漏水" : "可以按计划或手动浇水", ZoneManager::leakAlertActive() ? "danger" : nullptr, "irrMetricSafety");
    sendMetricCard("正在浇水", runningText, "正在执行 / 已启用水路", nullptr, "irrMetricRunning");
    sendMetricCard("今日计划", todayPlanText, todayPlanCount > 0 ? "今天会按计划自动检查" : "今天没有启用的自动计划", nullptr, "irrMetricTodayPlans");
    sendMetricCard("异常提醒", errorText, errorCount > 0 ? "处理后可在水路状态中清除" : "没有需要处理的水路异常", errorCount > 0 ? "danger" : nullptr, "irrMetricErrors");
    Esp32BaseWeb::endMetricGrid();
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("水路状态");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>水路</th><th>状态</th><th>任务</th><th>目标时长</th><th>剩余时间</th><th>脉冲</th><th>估算水量</th><th>操作</th></tr></thead><tbody>");
    bool wroteStatus = false;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        if (!status.enabled) {
            continue;
        }
        const Irrigation::ZoneConfig& config = ZoneManager::config(zoneId);
        wroteStatus = true;
        Esp32BaseWeb::sendChunk("<tr data-irr-zone-row='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("' data-state='");
        Esp32BaseWeb::writeHtmlEscaped(Irrigation::zoneStateName(status.state));
        Esp32BaseWeb::sendChunk("' data-busy='");
        Esp32BaseWeb::sendChunk(status.busy ? "1" : "0");
        Esp32BaseWeb::sendChunk("' data-error='");
        Esp32BaseWeb::sendChunk(status.errorActive ? "1" : "0");
        Esp32BaseWeb::sendChunk("' data-zone-name='");
        Esp32BaseWeb::writeHtmlEscaped(config.name);
        Esp32BaseWeb::sendChunk("'><td>");
        Esp32BaseWeb::writeHtmlEscaped(config.name);
        Esp32BaseWeb::sendChunk("</td><td data-irr-state='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>");
        if (status.errorActive) {
            Esp32BaseWeb::sendChunk("<button type='button' class='tag danger' style='border:0;cursor:pointer' onclick='irrFaultOpen(\"irrFaultDialog");
            writeUInt(zoneId);
            Esp32BaseWeb::sendChunk("\")'>");
            Esp32BaseWeb::writeHtmlEscaped(zoneStateLabel(status.state));
            Esp32BaseWeb::sendChunk("</button>");
        } else {
            Esp32BaseWeb::sendChunk("<span class='tag");
            Esp32BaseWeb::sendChunk(uiToneForState(status.state));
            Esp32BaseWeb::sendChunk("'>");
            Esp32BaseWeb::writeHtmlEscaped(zoneStateLabel(status.state));
            Esp32BaseWeb::sendChunk("</span>");
        }
        Esp32BaseWeb::sendChunk("</td><td data-irr-task='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::writeHtmlEscaped(status.busy ? taskTypeLabel(status.taskType) : "-");
        Esp32BaseWeb::sendChunk("</td><td data-irr-target='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>");
        writeDurationHuman(status.targetSec);
        Esp32BaseWeb::sendChunk("</td><td data-irr-remaining='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>");
        writeDurationHuman(status.remainingSec);
        Esp32BaseWeb::sendChunk("</td><td data-irr-pulses='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>");
        writeUInt(status.pulses);
        Esp32BaseWeb::sendChunk("</td><td data-irr-ml='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>");
        writeLitersFromMilliliters(status.estimatedMilliliters);
        Esp32BaseWeb::sendChunk("</td><td data-irr-actions='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'><div class='fsactions'>");
        if (status.busy) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/zone/stop' onsubmit=\"return confirm('确认停止该水路？')&&once(this)\">");
            writeOnePostHidden("source", "web_page");
            writeHiddenU32("zoneId", zoneId);
            Esp32BaseWeb::sendChunk("<input class='fsaction' type='submit' value='停止'></form>");
        }
        if (status.errorActive) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/zone/clear-error' onsubmit=\"return confirm('");
            Esp32BaseWeb::writeHtmlEscaped(zoneErrorClearConfirm(status.errorCode));
            Esp32BaseWeb::sendChunk("')&&once(this)\">");
            writeOnePostHidden("source", "web_page");
            writeHiddenU32("zoneId", zoneId);
            Esp32BaseWeb::sendChunk("<input class='fsaction' type='submit' value='清除异常'></form>");
        }
        if (!status.busy && !status.errorActive) {
            if (ZoneManager::leakAlertActive()) {
                Esp32BaseWeb::sendChunk("<span class='muted'>漏水告警中</span>");
            } else {
                Esp32BaseWeb::sendChunk("<button class='btnlink compact ok' type='button' data-zone-id='");
                writeUInt(zoneId);
                Esp32BaseWeb::sendChunk("' data-zone-name='");
                Esp32BaseWeb::writeHtmlEscaped(config.name);
                Esp32BaseWeb::sendChunk("' onclick='irrManualOpen(this)'>启动</button>");
            }
        }
        Esp32BaseWeb::sendChunk("</div></td></tr>");
    }
    if (!wroteStatus) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='8'>暂无启用水路</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div><div class='actions'><form method='post' action='/api/v1/zones/stop-all' onsubmit=\"return confirm('确认停止全部水路？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input id='irrStopAll' class='danger' type='submit' value='全部停止'");
    Esp32BaseWeb::sendChunk(runningCount > 0 ? "" : " disabled");
    Esp32BaseWeb::sendChunk("></form></div>");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        if (status.enabled && status.errorActive) {
            writeZoneErrorDialog(zoneId, ZoneManager::config(zoneId), ZoneErrorStore::get(zoneId));
        }
    }
    Esp32BaseWeb::sendChunk("<script>"
                            "function irrFaultOpen(id){var d=document.getElementById(id);if(!d)return;if(d.showModal)d.showModal();else d.setAttribute('open','open');}"
                            "function irrFaultClose(b){var d=b&&b.closest?b.closest('dialog'):null;if(d&&d.close)d.close();else if(d)d.removeAttribute('open');}"
                            "function irrOverviewDuration(s){s=parseInt(s||0,10)||0;var h=Math.floor(s/3600),m=Math.floor((s%3600)/60),r=s%60,t='';if(h)t+=h+'小时';if(m)t+=m+'分钟';if(r||!t)t+=r+'秒';return t;}"
                            "function irrOverviewLiters(ml){ml=parseInt(ml||0,10)||0;return Math.floor(ml/1000)+'.'+('00'+(ml%1000)).slice(-3)+' L';}"
                            "function irrOverviewEscape(s){return String(s||'').replace(/[&<>\"']/g,function(c){return {'&':'&amp;','<':'&lt;','>':'&gt;','\"':'&quot;',\"'\":'&#39;'}[c];});}"
                            "function irrOverviewStateLabel(s){return {disabled:'已禁用',idle:'待机',starting:'启动中',running:'浇水中',error:'异常'}[s]||'未知';}"
                            "function irrOverviewStateTone(s){return s==='running'||s==='starting'?' warn':(s==='error'?' danger':(s==='idle'?' ok':''));}"
                            "function irrOverviewSetMetric(id,value){var e=document.querySelector('#'+id+' b');if(e)e.textContent=value;}"
                            "function irrOverviewRefreshMs(data){if(document.hidden)return 60000;return data&&data.zones&&data.zones.some(function(z){return z.busy;})?1000:30000;}"
                            "function irrOverviewInitialFast(){return !!document.querySelector('[data-irr-zone-row][data-busy=\"1\"]');}"
                            "function irrOverviewRenderState(z){var e=document.querySelector('[data-irr-state=\"'+z.zoneId+'\"]');if(e)e.innerHTML='<span class=\"tag'+irrOverviewStateTone(z.state)+'\">'+irrOverviewEscape(irrOverviewStateLabel(z.state))+'</span>';}"
                            "function irrOverviewRenderActions(row,z,leak){var e=document.querySelector('[data-irr-actions=\"'+z.zoneId+'\"]');if(!e)return;var name=irrOverviewEscape(row.dataset.zoneName||('水路 '+z.zoneId));if(z.busy){e.innerHTML='<div class=\"fsactions\"><form method=\"post\" action=\"/api/v1/zone/stop\" onsubmit=\"return confirm(\\'确认停止该水路？\\')&&once(this)\"><input type=\"hidden\" name=\"source\" value=\"web_page\"><input type=\"hidden\" name=\"zoneId\" value=\"'+z.zoneId+'\"><input class=\"fsaction\" type=\"submit\" value=\"停止\"></form></div>';return;}e.innerHTML=leak?'<div class=\"fsactions\"><span class=\"muted\">漏水告警中</span></div>':'<div class=\"fsactions\"><button class=\"btnlink compact ok\" type=\"button\" data-zone-id=\"'+z.zoneId+'\" data-zone-name=\"'+name+'\" onclick=\"irrManualOpen(this)\">启动</button></div>';}"
                            "function irrOverviewApplyStatus(data){if(!data||!data.ok||!data.zones)return;var enabled=0,running=0,errors=0,structural=false;data.zones.forEach(function(z){if(!z.enabled)return;enabled++;if(z.busy)running++;if(z.errorActive)errors++;var row=document.querySelector('[data-irr-zone-row=\"'+z.zoneId+'\"]');if(!row){structural=true;return;}var busy=z.busy?'1':'0',err=z.errorActive?'1':'0';if(row.dataset.error!==err){structural=true;return;}row.dataset.state=z.state;row.dataset.busy=busy;row.dataset.error=err;irrOverviewRenderState(z);var e=document.querySelector('[data-irr-task=\"'+z.zoneId+'\"]');if(e)e.textContent=z.busy?(z.taskLabel||'浇水中'):'-';e=document.querySelector('[data-irr-target=\"'+z.zoneId+'\"]');if(e)e.textContent=irrOverviewDuration(z.targetSec);e=document.querySelector('[data-irr-remaining=\"'+z.zoneId+'\"]');if(e)e.textContent=irrOverviewDuration(z.remainingSec);e=document.querySelector('[data-irr-pulses=\"'+z.zoneId+'\"]');if(e)e.textContent=String(z.pulses);e=document.querySelector('[data-irr-ml=\"'+z.zoneId+'\"]');if(e)e.textContent=irrOverviewLiters(z.estimatedMl);irrOverviewRenderActions(row,z,data.leakAlertActive);});if(enabled!==document.querySelectorAll('[data-irr-zone-row]').length)structural=true;if(structural){location.reload();return;}irrOverviewSetMetric('irrMetricRunning',running+' / '+enabled);irrOverviewSetMetric('irrMetricErrors',String(errors));irrOverviewSetMetric('irrMetricSafety',data.leakAlertActive?'漏水告警':(errors>0?errors+' 路异常':'正常'));var stop=document.getElementById('irrStopAll');if(stop)stop.disabled=running<=0;}"
                            "var irrOverviewTimer=0;function irrOverviewSchedule(ms){if(irrOverviewTimer)clearTimeout(irrOverviewTimer);irrOverviewTimer=setTimeout(irrOverviewPoll,ms);}"
                            "function irrOverviewPoll(){fetch('/api/v1/status',{headers:{Accept:'application/json'},credentials:'same-origin'}).then(function(r){return r.ok?r.json():null;}).then(function(j){irrOverviewApplyStatus(j);irrOverviewSchedule(irrOverviewRefreshMs(j));}).catch(function(){irrOverviewSchedule(45000);});}"
                            "function irrOverviewPollNow(){irrOverviewSchedule(0);}"
                            "irrOverviewSchedule(irrOverviewInitialFast()?1000:30000);"
                            "</script>");
    writeManualStartDialog();
    Esp32BaseWeb::endPanel();
    pageFooter();
}

