tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
    Esp32BaseWeb::beginPanel("校准配置");
    Esp32BaseWeb::sendChunk("<div class='calibration-metrics'>");
    char text[32];
    snprintf(text, sizeof(text), "%u 条", static_cast<unsigned>(system.calibrationSampleTarget));
    sendMetricCard("样本容量", text, "只限制新增样本");
    snprintf(text, sizeof(text), "%u 分钟", static_cast<unsigned>(system.calibrationMaxCaptureMin));
    sendMetricCard("单次最长", text, "超时样本无效");
    snprintf(text, sizeof(text), "%u 秒", static_cast<unsigned>(system.calibrationDetailCaptureSec));
    sendMetricCard("明细采集", text, "原始脉冲时间差");
    snprintf(text, sizeof(text), "%u 个", static_cast<unsigned>(system.calibrationDetailPulseLimit));
    sendMetricCard("明细脉冲上限", text, "只限制明细");
    Esp32BaseWeb::sendChunk("</div><div class='calibration-internal'><span>稳定窗口 2000 ms</span><span>滑动步进 200 ms</span><span>连续窗口 5</span><span>波动阈值 10%</span><span>稳定扫描从 1000 ms 开始</span></div><div class='actions'><a class='btnlink secondary' href='/esp32base/app-config'>修改校准配置</a></div>");
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("采集样本");
    Esp32BaseWeb::sendChunk("<div class='calibration-sample-top'><form method='post' action='/api/v1/calibration/clear' onsubmit=\"return confirm('确认清空当前校准样本？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input class='secondary' type='submit' value='清空样本'></form></div><div class='calibration-workflow'><div class='calibration-stage'><h3>状态</h3><span class='tag");
    Esp32BaseWeb::sendChunk(FlowCalibration::state() == FlowCalibration::State::IDLE ? " ok" : " warn");
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::writeHtmlEscaped(calibrationStateLabel(FlowCalibration::state()));
    Esp32BaseWeb::sendChunk("</span><p>");
    Esp32BaseWeb::sendChunk("已保存 ");
    writeUInt(FlowCalibration::sampleCount());
    Esp32BaseWeb::sendChunk(" 条，有效 ");
    writeUInt(FlowCalibration::validSampleCount());
    Esp32BaseWeb::sendChunk(" 条，容量 ");
    writeUInt(system.calibrationSampleTarget);
    Esp32BaseWeb::sendChunk(" 条</p></div><div class='calibration-stage'><h3>接水</h3>");
    if (FlowCalibration::state() == FlowCalibration::State::CAPTURING) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/calibration/stop' onsubmit=\"return once(this)\">");
        writeOnePostHidden("source", "web_page");
        Esp32BaseWeb::sendChunk("<p>接到量杯目标水量后停止出水。</p><div class='actions'><input type='submit' value='停止并输入水量'></div></form>");
    } else if (FlowCalibration::state() == FlowCalibration::State::WAITING_ACTUAL) {
        Esp32BaseWeb::sendChunk("<p>已停止出水，请在右侧保存本次实测水量。</p>");
    } else if (FlowCalibration::sampleCount() >= system.calibrationSampleTarget) {
        Esp32BaseWeb::sendChunk("<p>当前样本数已达到配置容量；可先生成候选参数，或清空样本后重新采集。</p>");
    } else {
        Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/v1/calibration/start' onsubmit=\"return confirm('确认开始校准出水？')&&once(this)\">");
        writeOnePostHidden("source", "web_page");
        Esp32BaseWeb::sendChunk("<p>选择水路，准备量杯后开始接水。</p><p class='field short'><label>水路</label><select name='zoneId'>");
        for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
            const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
            Esp32BaseWeb::sendChunk("<option value='");
            writeUInt(zoneId);
            Esp32BaseWeb::sendChunk("'");
            if (!zone.enabled) {
                Esp32BaseWeb::sendChunk(" disabled");
            }
            Esp32BaseWeb::sendChunk(">");
            Esp32BaseWeb::writeHtmlEscaped(zone.name);
            Esp32BaseWeb::sendChunk(zone.enabled ? "" : "（停用）");
            Esp32BaseWeb::sendChunk("</option>");
        }
        Esp32BaseWeb::sendChunk("</select></p><div class='actions'><input type='submit' value='开始接水'></div></form>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='calibration-stage'><h3>保存样本</h3>");
    if (FlowCalibration::state() == FlowCalibration::State::WAITING_ACTUAL) {
        Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/v1/calibration/sample' onsubmit=\"return confirm('确认保存本次校准样本？')&&once(this)\">");
        writeOnePostHidden("source", "web_page");
        Esp32BaseWeb::sendChunk("<p>输入量杯实测水量后保存样本。</p><p class='field short'><label>实际水量 ml</label><input name='actualMl' type='number' min='1' max='100000' required></p><div class='actions'><input type='submit' value='保存样本'></div></form>");
    } else if (FlowCalibration::state() == FlowCalibration::State::CAPTURING) {
        Esp32BaseWeb::sendChunk("<p>停止出水后，这里会要求输入实际水量。</p>");
    } else {
        Esp32BaseWeb::sendChunk("<p>完成一次接水后，在这里输入实际水量并保存。</p>");
    }
    Esp32BaseWeb::sendChunk("</div></div>");
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("样本");
    Esp32BaseWeb::sendChunk("<dialog id='calibrationActualDialog' class='calibration-dialog'><form method='post' action='/api/v1/calibration/sample/update' onsubmit=\"return confirm('确认修改该样本实际水量？')&&once(this)\"><input type='hidden' name='source' value='web_page'><input id='calibrationActualIndex' type='hidden' name='sampleIndex'><h3>修改实际水量</h3><p class='field short'><label>实际水量 ml</label><input id='calibrationActualInput' name='actualMl' type='number' min='1' max='100000' required></p><div class='actions'><input type='submit' value='保存修改'><button class='btnlink secondary' type='button' onclick='document.getElementById(\"calibrationActualDialog\").close()'>取消</button></div></form></dialog>");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>#</th><th>水路</th><th>状态</th><th>实际水量</th><th>总脉冲</th><th>时长</th><th>稳定开始</th><th>启动脉冲</th><th>波动</th><th>操作</th></tr></thead><tbody>");
    for (uint8_t i = 0; i < FlowCalibration::sampleCount(); ++i) {
        const FlowCalibration::Sample& sample = FlowCalibration::sample(i);
        Esp32BaseWeb::sendChunk("<tr><td>");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(sample.zoneId);
        Esp32BaseWeb::sendChunk("</td><td>");
        if (sample.valid) {
            Esp32BaseWeb::sendChunk(sample.stableDetected ? "有效" : "有效，未识别稳定点");
        } else {
            Esp32BaseWeb::writeHtmlEscaped(sample.invalidReason);
        }
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(sample.actualMl);
        Esp32BaseWeb::sendChunk(" ml</td><td>");
        writeUInt(sample.totalPulses);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeDurationMsHumanCompact(sample.durationMs);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeDurationMsHumanCompact(sample.stableStartMs);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(sample.startupPulseInSample);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(sample.rateVariationPermille);
        Esp32BaseWeb::sendChunk("‰</td><td><div class='calibration-sample-actions'><button class='btnlink compact secondary' type='button' onclick='calibrationEditActual(");
        writeUInt(i);
        Esp32BaseWeb::sendChunk(",");
        writeUInt(sample.actualMl);
        Esp32BaseWeb::sendChunk(")'>修改</button><a class='btnlink compact' href='/irrigation/calibration/sample?index=");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk("'>详情</a></div></td></tr>");
    }
    if (FlowCalibration::sampleCount() == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='10'>暂无样本</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div><div class='actions'><form method='post' action='/api/v1/calibration/compute' onsubmit=\"return confirm('确认生成候选参数？这会替换该水路当前候选参数。')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input type='submit' value='生成候选参数'></form></div><script>function calibrationEditActual(i,ml){var d=document.getElementById('calibrationActualDialog');document.getElementById('calibrationActualIndex').value=String(i);document.getElementById('calibrationActualInput').value=String(ml||'');if(d.showModal)d.showModal();else d.setAttribute('open','open');}</script>");
    Esp32BaseWeb::endPanel();

    const FlowCalibration::Recommendation& rec = FlowCalibration::recommendation();
    if (rec.valid) {
        Esp32BaseWeb::beginPanel("候选参数诊断");
        Esp32BaseWeb::sendChunk("<div class='calibration-note'><b>运行估算公式</b><br><code>P</code> 为总脉冲，<code>S</code> 为启动阶段脉冲，<code>V0</code> 为启动阶段水量，<code>K</code> 为稳定脉冲 P/L。<br>未过启动阶段：<code>P <= S，水量 = P × V0 / S</code>。<br>超过启动阶段：<code>P > S，水量 = V0 + (P - S) × 1000 / K</code>。</div>");
        Esp32BaseWeb::sendChunk("<div class='calibration-note'><b>参数生成算法</b><br>系统从样本脉冲时间差还原时间线，用 2 秒窗口、200 ms 步进扫描流速，找到连续稳定的起点；稳定起点前的脉冲数作为启动阶段参考。多个样本取中位数附近搜索候选启动脉冲，并拟合启动阶段水量和稳定脉冲 P/L，选择平均误差和最大误差最小的一组。</div>");
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><tbody><tr><th>水路</th><td>");
        writeUInt(rec.zoneId);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>启动阶段脉冲</th><td>");
        writeUInt(rec.flow.startupPulseLimit);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>启动阶段水量</th><td>");
        writeUInt(rec.flow.startupEstimatedMl);
        Esp32BaseWeb::sendChunk(" ml</td></tr><tr><th>稳定脉冲 P/L</th><td>");
        writeUInt(rec.flow.stablePulsePerLiter);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>有效样本数</th><td>");
        writeUInt(rec.sampleCount);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>稳定点识别</th><td>");
        writeUInt(rec.stableDetectedCount);
        Esp32BaseWeb::sendChunk(" / ");
        writeUInt(rec.sampleCount);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>水量跨度</th><td>");
        writePermilleAsPercent(rec.volumeSpanPermille);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>脉冲跨度</th><td>");
        writePermilleAsPercent(rec.pulseSpanPermille);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>样本内平均误差</th><td>");
        if (rec.sampleCount < 2) {
            Esp32BaseWeb::sendChunk("无法评估");
        } else {
            writePermilleAsPercent(rec.averageErrorPermille);
        }
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>样本内最大误差</th><td>");
        if (rec.sampleCount < 2) {
            Esp32BaseWeb::sendChunk("无法评估");
        } else {
            writePermilleAsPercent(rec.maxErrorPermille);
        }
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>建议</th><td>");
        Esp32BaseWeb::writeHtmlEscaped(calibrationRecommendationAdvice(rec));
        Esp32BaseWeb::sendChunk("</td></tr></tbody></table></div>");
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>样本</th><th>实际</th><th>估算</th><th>误差</th></tr></thead><tbody>");
        for (uint8_t i = 0; i < rec.sampleCount; ++i) {
            Esp32BaseWeb::sendChunk("<tr><td>");
            writeUInt(rec.errors[i].sampleIndex + 1);
            Esp32BaseWeb::sendChunk("</td><td>");
            writeUInt(rec.errors[i].actualMl);
            Esp32BaseWeb::sendChunk(" ml</td><td>");
            writeUInt(rec.errors[i].estimatedMl);
            Esp32BaseWeb::sendChunk(" ml</td><td>");
            if (rec.errors[i].errorMl < 0) {
                Esp32BaseWeb::sendChunk("-");
                writeUInt(static_cast<uint32_t>(-rec.errors[i].errorMl));
            } else {
                writeUInt(static_cast<uint32_t>(rec.errors[i].errorMl));
            }
            Esp32BaseWeb::sendChunk(" ml / ");
            writeUInt(rec.errors[i].errorPermille);
            Esp32BaseWeb::sendChunk("‰</td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div><p class='calibration-param-note'>以上诊断对应最近一次生成的候选参数。请在“流量参数”面板中确认并应用候选参数。</p>");
        Esp32BaseWeb::endPanel();
    }
    pageFooter();
}

