tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleCalibrationStopApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (!FlowCalibration::stop()) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationSampleApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint32_t actualMl = 0;
    if (!readU32("actualMl", &actualMl) || actualMl == 0) {
        sendError(400, "invalid_actual_ml");
        return;
    }
    if (!FlowCalibration::submitActualMilliliters(actualMl)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationSampleUpdateApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t sampleIndex = 0;
    uint32_t actualMl = 0;
    if (!readU8("sampleIndex", &sampleIndex) ||
        !readU32("actualMl", &actualMl) ||
        actualMl == 0) {
        sendError(400, "invalid_sample_update");
        return;
    }
    if (!FlowCalibration::updateActualMilliliters(sampleIndex, actualMl)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationComputeApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    FlowCalibration::Recommendation rec = {};
    if (!FlowCalibration::computeRecommendation(&rec)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    if (!FlowCalibration::saveCandidate()) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationCandidateSaveApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    Irrigation::FlowParameters params = {};
    if (!readZoneId(&zoneId) || !readFlowParameters(&params)) {
        sendError(400, "invalid_candidate");
        return;
    }
    if (!ZoneConfigStore::saveCandidate(zoneId, params)) {
        sendError(400, "candidate_save_failed");
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationApplyApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    if (ZoneManager::isZoneBusy(zoneId)) {
        sendError(409, "zone_busy");
        return;
    }
    const Irrigation::ZoneConfig& before = ZoneConfigStore::get(zoneId);
    if (!before.candidateFlow.exists) {
        sendError(409, "no_candidate");
        return;
    }
    if (ZoneConfigStore::flowParametersEqual(before.flow, before.candidateFlow.params)) {
        sendError(409, "candidate_unchanged");
        return;
    }
    Irrigation::FlowParameters oldParams = {};
    Irrigation::FlowParameters newParams = {};
    if (!ZoneConfigStore::applyCandidate(zoneId, &oldParams, &newParams)) {
        sendError(409, "candidate_apply_failed");
        return;
    }
    (void)ZoneManager::reloadZone(zoneId);
    BusinessEventLog::appendFlowCandidateApplied(zoneId, oldParams, newParams, wantsRedirect() ? "web" : "api");
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationPreviousRestoreApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    if (ZoneManager::isZoneBusy(zoneId)) {
        sendError(409, "zone_busy");
        return;
    }
    Irrigation::FlowParameters oldParams = {};
    Irrigation::FlowParameters newParams = {};
    if (!ZoneConfigStore::restorePrevious(zoneId, &oldParams, &newParams)) {
        sendError(409, "previous_restore_failed");
        return;
    }
    (void)ZoneManager::reloadZone(zoneId);
    BusinessEventLog::appendFlowPreviousRestored(zoneId, oldParams, newParams, wantsRedirect() ? "web" : "api");
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationClearApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    (void)FlowCalibration::clear();
    redirectOrOk("/irrigation/calibration");
}

void handleZoneStartApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    uint32_t durationSec = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_start_request");
        return;
    }
    if (Esp32BaseWeb::hasParam("durationMin")) {
        uint32_t durationMin = 0;
        if (!readU32("durationMin", &durationMin) || durationMin == 0 || durationMin > (SystemConfigStore::current().maxWateringDurationSec / 60UL)) {
            sendError(400, "invalid_start_duration");
            return;
        }
        durationSec = durationMin * 60UL;
    } else if (!readU32("durationSec", &durationSec)) {
        sendError(400, "invalid_start_request");
        return;
    }
    if (!ZoneManager::startManual(zoneId, durationSec, startSourceFromRequest())) {
        sendError(409, "zone_start_rejected");
        return;
    }
    redirectOrOk();
}

